spec/fixtures/soap/xml/IControl.LocalLB.ProfileHttpClass.remove_header_match_pattern_b1c0c2d04d265511c51b10f4f4bc2a22_request.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="urn:iControl:LocalLB/ProfileHttpClass"><env:Body><wsdl:remove_header_match_pattern><profile_names><value>test_profile2</value></profile_names><patterns><item><value><pattern>test_header-regexp</pattern><is_glob>false</is_glob></value></item></patterns></wsdl:remove_header_match_pattern></env:Body></env:Envelope>